nyh-workshop/sk1632-i2s-dma/v1_07_01/framework/peripheral/bmx/processor/bmx_p32mx150f128b.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _BMX_P32MX150F128B_H
#define _BMX_P32MX150F128B_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    BMX_ID_0 = 0,
    BMX_NUMBER_OF_MODULES

} BMX_MODULE_ID;

PLIB_INLINE SFR_TYPE* _BMX_ARB_MODE_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXCON;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_DRM_WS_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXCON;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_BUS_EXCEPTION_INST_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXCON;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_BUS_EXCEPTION_DATA_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXCON;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_BUS_EXCEPTION_DMA_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXCON;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_BUS_EXCEPTION_ICD_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXCON;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_BUS_EXCEPTION_IXI_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXCON;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_PFM_CACHE_DMA_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXCON;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_BMXDKPBA_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXDKPBA;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_BMXDUDBA_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXDUDBA;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_BMXDUPBA_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXDUPBA;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_BMXPUPBA_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXPUPBA;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_BMXDRMSZ_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXDRMSZ;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_BMXPFMSZ_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXPFMSZ;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _BMX_BMXBOOTSZ_VREG(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return &BMXBOOTSZ;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_ARB_MODE_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXARB_MASK;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_DRM_WS_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXWSDRM_MASK;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_INST_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRIS_MASK;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_DATA_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRDS_MASK;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_DMA_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRDMA_MASK;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_ICD_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRICD_MASK;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_IXI_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRIXI_MASK;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_PFM_CACHE_DMA_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXCHEDMA_MASK;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

