nyh-workshop/sk1632-i2s-dma/v1_07_01/framework/peripheral/bmx/processor/bmx_p32mx150f128b.h
PLIB_INLINE SFR_DATA _BMX_BMXDKPBA_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)-1;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXDUDBA_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)-1;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXDUPBA_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)-1;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXPUPBA_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)-1;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXDRMSZ_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)-1;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXPFMSZ_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)-1;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXBOOTSZ_MASK(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)-1;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_ARB_MODE_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXARB_POSITION;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_DRM_WS_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXWSDRM_POSITION;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_INST_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRIS_POSITION;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_DATA_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRDS_POSITION;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_DMA_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRDMA_POSITION;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_ICD_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRICD_POSITION;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_IXI_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRIXI_POSITION;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_PFM_CACHE_DMA_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXCHEDMA_POSITION;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXDKPBA_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)0;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXDUDBA_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)0;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXDUPBA_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)0;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXPUPBA_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)0;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXDRMSZ_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)0;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXPFMSZ_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)0;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXBOOTSZ_POS(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)0;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_ARB_MODE_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXARB_LENGTH;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_DRM_WS_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXWSDRM_LENGTH;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_INST_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRIS_LENGTH;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_DATA_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRDS_LENGTH;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_DMA_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRDMA_LENGTH;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_ICD_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRICD_LENGTH;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

