nyh-workshop/sk1632-i2s-dma/v1_07_01/framework/peripheral/bmx/processor/bmx_p32mx150f128b.h
PLIB_INLINE SFR_DATA _BMX_BUS_EXCEPTION_IXI_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXERRIXI_LENGTH;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_PFM_CACHE_DMA_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return _BMXCON_BMXCHEDMA_LENGTH;
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXDKPBA_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXDUDBA_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXDUPBA_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXPUPBA_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXDRMSZ_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXPFMSZ_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _BMX_BMXBOOTSZ_LEN(BMX_MODULE_ID i)
{
    switch (i) {
        case BMX_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/bmx_ArbitrationMode_Default.h"
#include "../templates/bmx_DataRamWaitState_Default.h"
#include "../templates/bmx_ProgramFlashMemoryCacheDma_Default.h"
#include "../templates/bmx_BusExceptionIXI_Default.h"
#include "../templates/bmx_BusExceptionICD_Default.h"
#include "../templates/bmx_BusExceptionDMA_Default.h"
#include "../templates/bmx_BusExceptionData_Default.h"
#include "../templates/bmx_BusExceptionInstruction_Default.h"
#include "../templates/bmx_ProgramFlashPartition_Default.h"
#include "../templates/bmx_DataRAMPartition_Default.h"
#include "../templates/bmx_ProgramFlashMemorySize_Default.h"
#include "../templates/bmx_DataRAMSize_Default.h"
#include "../templates/bmx_ProgramFlashBootSize_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API bool PLIB_BMX_ExistsArbitrationMode(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsArbitrationMode_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_BMX_ArbitrationModeSet(BMX_MODULE_ID index, PLIB_BMX_ARB_MODE mode)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_ArbitrationModeSet_Default(index, mode);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API PLIB_BMX_ARB_MODE PLIB_BMX_ArbitrationModeGet(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ArbitrationModeGet_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (PLIB_BMX_ARB_MODE)0;
    }
}

PLIB_INLINE_API bool PLIB_BMX_ExistsDataRamWaitState(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsDataRamWaitState_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_BMX_DataRamWaitStateSet(BMX_MODULE_ID index, PLIB_BMX_DATA_RAM_WAIT_STATES wait)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_DataRamWaitStateSet_Default(index, wait);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API PLIB_BMX_DATA_RAM_WAIT_STATES PLIB_BMX_DataRamWaitStateGet(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_DataRamWaitStateGet_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (PLIB_BMX_DATA_RAM_WAIT_STATES)0;
    }
}

PLIB_INLINE_API bool PLIB_BMX_ExistsProgramFlashMemoryCacheDma(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsProgramFlashMemoryCacheDma_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_BMX_ProgramFlashMemoryCacheDmaEnable(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_ProgramFlashMemoryCacheDmaEnable_Default(index);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_BMX_ProgramFlashMemoryCacheDmaDisable(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_ProgramFlashMemoryCacheDmaDisable_Default(index);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_BMX_ExistsBusExceptionIXI(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsBusExceptionIXI_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_BMX_BusExceptionIXIEnable(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_BusExceptionIXIEnable_Default(index);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_BMX_BusExceptionIXIDisable(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_BusExceptionIXIDisable_Default(index);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_BMX_ExistsBusExceptionICD(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsBusExceptionICD_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_BMX_BusExceptionICDEnable(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_BusExceptionICDEnable_Default(index);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_BMX_BusExceptionICDDisable(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_BusExceptionICDDisable_Default(index);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

